In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib import colors
import plotly
from sklearn.preprocessing import LabelEncoder
from scipy.sparse import csr_matrix, hstack

%matplotlib inline

In [2]:
path = "Data/"
sample_submission = pd.read_csv(path + "sample_submission.csv")
app_events = pd.read_csv(path + "app_events.csv")
app_labels = pd.read_csv(path + "app_labels.csv")
events = pd.read_csv(path + "events.csv", dtype = {"device_id": np.str},\
                    infer_datetime_format = True, parse_dates = ["timestamp"])
gender_age_test = pd.read_csv(path + "gender_age_test.csv")
gender_age_train = pd.read_csv(path + "gender_age_train.csv", dtype = {"device_id": np.str, "age": np.int8})
phone_brand_device_model = pd.read_csv(path + "phone_brand_device_model.csv", dtype = {"device_id": np.str},\
                    encoding = "UTF-8")
label_categories = pd.read_csv(path + "label_categories.csv")

In [3]:
#labeling train and test data
gender_age_test['test'] = np.arange(gender_age_test.shape[0])
gender_age_train['train'] = np.arange(gender_age_train.shape[0])

In [12]:
app_events.head(5)

(74645, 5)

In [5]:
app_labels.head(5)

                app_id  label_id
0  7324884708820027918       251
1 -4494216993218550286       251
2  6058196446775239644       406
3  6058196446775239644       407
4  8694625920731541625       406

In [7]:
events.head(5)

   event_id             device_id           timestamp  longitude  latitude
0         1     29182687948017175 2016-05-01 00:55:25     121.38     31.24
1         2  -6401643145415154744 2016-05-01 00:54:12     103.65     30.97
2         3  -4833982096941402721 2016-05-01 00:08:05     106.60     29.70
3         4  -6815121365017318426 2016-05-01 00:06:40     104.27     23.28
4         5  -5373797595892518570 2016-05-01 00:07:18     115.88     28.66

In [8]:
gender_age_test.head(5)

             device_id  test
0  1002079943728939269     0
1 -1547860181818787117     1
2  7374582448058474277     2
3 -6220210354783429585     3
4 -5893464122623104785     4

In [9]:
gender_age_train.head(5)

              device_id gender  age   group  train
0  -8076087639492063270      M   35  M32-38      0
1  -2897161552818060146      M   35  M32-38      1
2  -8260683887967679142      M   35  M32-38      2
3  -4938849341048082022      M   30  M29-31      3
4    245133531816851882      M   30  M29-31      4

In [21]:
print(phone_brand_device_model.head(5))

brandencoder = LabelEncoder().fit(phone_brand_device_model.phone_brand)
phone_brand_device_model['brand'] = brandencoder.transform(phone_brand_device_model['phone_brand'])

gender_age_train['brand'] = phone_brand_device_model['brand']
gender_age_test['brand'] = phone_brand_device_model['brand']

Xtr_brand = csr_matrix((np.ones(gender_age_train.shape[0]), 
                       (gender_age_train.train, gender_age_train.brand)))
Xte_brand = csr_matrix((np.ones(gender_age_test.shape[0]), 
                       (gender_age_test.test, gender_age_test.brand)))

print('\nBrand features: train shape {}, test shape {}'.format(Xtr_brand.shape, Xte_brand.shape))

              device_id phone_brand   device_model  brand
0  -8890648629457979026          小米             红米     51
1   1277779817574759137          小米           MI 2     51
2   5137427614288105724          三星      Galaxy S4     15
3   3669464369358936369       SUGAR           时尚手机      9
4  -5019277647504317457          三星  Galaxy Note 2     15

Brand features: train shape (74645, 131), test shape (112071, 131)

In [22]:
label_categories.head(5)

(187245, 4)